Revit 2027 API
Wire.NumberOfVertices Property
 The number of vertices of the wire, including the start and end point.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfVertices { get; }
Public ReadOnly Property NumberOfVertices As Integer
	Get
public:
property int NumberOfVertices {
	int get ();
}
member NumberOfVertices : int with get
Property Value
Int32
See Also
Reference
Wire Class
Autodesk.Revit.DB.Electrical Namespace